In [52]:
import pandas as pd, numpy as np

In [53]:
df=pd.read_csv("test.csv",sep=';')
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       11       12       13       14
Row5      101      102      103      104

In [54]:
df.describe() #give stat of numerical columns

          Column1     Column2     Column3     Column4
count    5.000000    5.000000    5.000000    5.000000
mean    24.800000   25.800000   26.800000   27.800000
std     42.798364   42.798364   42.798364   42.798364
min      0.000000    1.000000    2.000000    3.000000
25%      4.000000    5.000000    6.000000    7.000000
50%      8.000000    9.000000   10.000000   11.000000
75%     11.000000   12.000000   13.000000   14.000000
max    101.000000  102.000000  103.000000  104.000000

In [55]:
df.info() #give info of entire dataset

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Column1  5 non-null      int64
 1   Column2  5 non-null      int64
 2   Column3  5 non-null      int64
 3   Column4  5 non-null      int64
dtypes: int64(4)
memory usage: 200.0+ bytes

In [56]:
df['Column1'].value_counts() #gives freq of each value like a dict

Column1
0      1
4      1
8      1
11     1
101    1
Name: count, dtype: int64

In [57]:
df[df['Column1']>5]

      Column1  Column2  Column3  Column4
Row3        8        9       10       11
Row4       11       12       13       14
Row5      101      102      103      104

In [58]:
from io import StringIO, BytesIO
data=(
    'col1,col2,col3\n'
    '1,2,3\n'
    '4,5,6\n'
    '7,8,9'
)
type(data)

str

In [59]:
df=pd.read_csv(StringIO(data),usecols=['col1','col3']) #usecols returns only mentioned columns
df.head()

   col1  col3
0     1     3
1     4     6
2     7     9

In [60]:
data=(
     'a,b,c,d\n'
    '1,2,3,4\n'
    '5,6,7,8\n'
    '10,11,12,13\n'
)
type(data)

str

In [61]:
df=pd.read_csv(StringIO(data),dtype=object)
df.head()

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2  10  11  12  13

In [62]:
df['a'][2]

'10'

In [63]:
df['b'][0:2]

0    2
1    6
Name: b, dtype: object

In [67]:
# specify dtype of each column seprately 
df=pd.read_csv(StringIO(data),dtype={'a':int,'b':float,'c':float,'d':object})
df.head()

    a     b     c   d
0   1   2.0   3.0   4
1   5   6.0   7.0   8
2  10  11.0  12.0  13

In [68]:
# index col 
data=(
    'index,col1,col2,col3\n'
    '4,1,2,3\n'
    '8,4,5,6\n'
)
type(data)

str

In [73]:
df=pd.read_csv(StringIO(data),index_col=0)
df.head()

       col1  col2  col3
index
4         1     2     3
8         4     5     6

In [74]:
data=(
    'col1,col2,col3\n'
    '1,2,3\n'
    '4,5,6\n'
)

In [75]:
df=pd.read_csv(StringIO(data), usecols=['col1','col3'],index_col=False)
df.head()

   col1  col3
0     1     3
1     4     6

In [84]:
# read quoted strings 
data='a,b\n"hello \\omkar shelke\\, how are you",5'

In [85]:
df=pd.read_csv(StringIO(data),escapechar='\\')
df.head()

                                 a  b
0  hello omkar shelke, how are you  5